haskell/Mutable_References.org
#+TITLE: Mutable References 
#+DESCRIPTIONS: Mutable references in Haskell 
#+KEWYWORDS:    haskell mutability mutable references io monad 
#+STARTUP:      showall

* Mutable References 
** IORef - Mutable References Inside IO Monad 
*** Overview 

The IORef type provides mutable references in the IO Monad. It allows
Haskell to perform computations with mutability like imperative languages.

Module: [[https://hackage.haskell.org/package/base-4.9.1.0/docs/Data-IORef.html][Data.IORef]]

| Function / Type |    | Signature                    | Description                                               |
|-----------------+----+------------------------------+-----------------------------------------------------------|
| *Types*         |    |                              |                                                           |
| data IORef a    |    |                              |                                                           |
|                 |    |                              |                                                           |
| *Functions*     |    |                              |                                                           |
|-----------------+----+------------------------------+-----------------------------------------------------------|
| newIORef        | :: | a -> IO (IORef a)            | Create new IORef                                          |
| readIORef       | :: | IORef a -> IO a              | Read IORef                                                |
| writeIORef      | :: | IORef a -> a -> IO ()        | Update IORef                                              |
| modifyIORef     | :: | IORef a -> (a -> a) -> IO () | Apply a function to the value in the IORef and update it. |
|                 |    |                              |                                                           |

*** Examples
