haskell/Mutable_References.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Mutable References</title>
<!-- 2018-06-17 Sun 02:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="nobody" />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Mutable References</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Mutable References</a>
<ul>
<li><a href="#sec-1-1">1.1. IORef - Mutable References Inside IO Monad</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Overview</a></li>
<li><a href="#sec-1-1-2">1.1.2. Examples</a>
<ul>
<li><a href="#sec-1-1-2-1">1.1.2.1. Simple IORef example in Haskell REPL:</a></li>
<li><a href="#sec-1-1-2-2">1.1.2.2. Stateful Function</a></li>
<li><a href="#sec-1-1-2-3">1.1.2.3. Example: Sum list elements in a imperative way using IORef.</a></li>
<li><a href="#sec-1-1-2-4">1.1.2.4. Infinite loop with delay</a></li>
<li><a href="#sec-1-1-2-5">1.1.2.5. Simulating objects with closures</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. ST Monad - Mutable References Inside Pure Functions</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Overview</a></li>
<li><a href="#sec-1-2-2">1.2.2. Examples</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/index.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mutable References</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> IORef - Mutable References Inside IO Monad</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The IORef type provides mutable references in the IO Monad. It allows
Haskell to perform computations with mutability like imperative languages.
</p>

<p>
Module: <a href="https://hackage.haskell.org/package/base-4.9.1.0/docs/Data-IORef.html">Data.IORef</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function / Type</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>Types</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">data IORef a</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Functions</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">newIORef</td>
<td class="left">::</td>
<td class="left">a -&gt; IO (IORef a)</td>
<td class="left">Create new IORef</td>
</tr>

<tr>
<td class="left">readIORef</td>
<td class="left">::</td>
<td class="left">IORef a -&gt; IO a</td>
<td class="left">Read IORef</td>
</tr>

<tr>
<td class="left">writeIORef</td>
<td class="left">::</td>
<td class="left">IORef a -&gt; a -&gt; IO ()</td>
<td class="left">Update IORef</td>
</tr>

<tr>
<td class="left">modifyIORef</td>
<td class="left">::</td>
<td class="left">IORef a -&gt; (a -&gt; a) -&gt; IO ()</td>
<td class="left">Apply a function to the value in the IORef and update it.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
