haskell/Mutable_References.org
**** Simple IORef example in Haskell REPL: 

#+BEGIN_SRC haskell
  {- ===== Check The Types ====== -}

  > import Data.IORef 
  > 
  > :info IORef
  newtype IORef a
    = GHC.IORef.IORef (GHC.STRef.STRef GHC.Prim.RealWorld a)
          -- Defined in ‘GHC.IORef’
  instance Eq (IORef a) -- Defined in ‘GHC.IORef’
  >

  > :t newIORef 
  newIORef :: a -> IO (IORef a)
  >
  > :t readIORef 
  readIORef :: IORef a -> IO a
  > 

  > :t modifyIORef
  modifyIORef :: IORef a -> (a -> a) -> IO ()
  > 

  {- === Experiment 1 - IORef within the REPL ========== -}

  {- | Extract IO a -> a is only possible in the REPL due to it be inside an IO monad. -}
  > cell <- newIORef (100.0 :: Double)
  > :t cell
  cell :: IORef Double
  > 

  > readIORef cell
  100.0
  > 
  > :t readIORef cell
  readIORef cell :: IO Double
  > 

  -- Apply a function to value returned from reading the cell 
  ---------------------------------------------------------------

  > fmap ((+)100) $ readIORef cell
  200.0
  > 

  > (*3) <$> ((+)100) <$> readIORef cell
  600.0
  > 

  > (+5) <$> (*3) <$> ((+)100) <$> readIORef cell
  605.0
  > 

  > (+5) . (*3) . ((+)100) <$> readIORef cell
  605.0
  > 

  > fmap ((+5) . (*3) . ((+)100)) $ readIORef cell
  605.0
  > 

  -- Update 
  ------------------------------------------------------------

  > :t writeIORef 
  writeIORef :: IORef a -> a -> IO ()
  > 

  > writeIORef cell 500.322
  > readIORef cell
  500.322
  > 

  >  fmap ((+5) . (*3) . ((+)100)) $ readIORef cell
  1805.966
  > 

  -- Modify 
  ----------------------------------------------------------

  > writeIORef cell 200.0


  > readIORef cell
  200.0
  > 

  > :t modifyIORef 
  modifyIORef :: IORef a -> (a -> a) -> IO ()
  >

  >  modifyIORef cell (\x -> 3.0 * x )
  > readIORef cell
  600.0

  >  modifyIORef cell (\x -> 3.0 * x )
  > readIORef cell
  1800.0

  >  modifyIORef cell (\x -> 3.0 * x )
  > readIORef cell
  5400.0
  > 

#+END_SRC

Example: Counter.

#+BEGIN_SRC haskell 
  import Data.IORef 

  :{    
  counter :: IO (IORef Int)
  counter = newIORef 0
  :}

  :{ 
  incrCounter :: IORef Int -> IO ()
  incrCounter cell = modifyIORef cell (\x -> x + 1) 
  :}

  :{
  showCounter cell = do
    value <- readIORef cell
    putStrLn $ "The counter value is " ++ show value
  :}
   
  > :t showCounter 
  showCounter :: Show a => IORef a -> IO ()
  > 

  > counter >>= showCounter 
  The counter value is 0
  > 

  :{
  testCounter1 c = do  
    incrCounter c
    incrCounter c
    incrCounter c
    showCounter c
  :}

  > :t testCounter1 
  testCounter1 :: IORef Int -> IO ()
  >  
  > testCounter1 =<< counter 
  The counter value is 3
  > 

  > showCounter =<< counter
  The counter value is 0
  > 
  > counter >>= showCounter 
  The counter value is 0
  > 



  > c <- counter 
  > :t c
  c :: IORef Int
  >
  > showCounter c
  The counter value is 0

  > incrCounter c
  > showCounter c
  The counter value is 1
  > 

  > incrCounter c >> showCounter c
  The counter value is 2
  > incrCounter c >> showCounter c
  The counter value is 3
  > incrCounter c >> showCounter c
  The counter value is 4
  > incrCounter c >> showCounter c
  The counter value is 5
  > incrCounter c >> showCounter c
  The counter value is 6
  > incrCounter c >> showCounter c
  The counter value is 7
  > incrCounter c >> showCounter c
  The counter value is 8
  > 

#+END_SRC

