haskell/Mutable_References.html

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Examples</h4>
<div class="outline-text-4" id="text-1-1-2">
</div><div id="outline-container-sec-1-1-2-1" class="outline-5">
<h5 id="sec-1-1-2-1"><span class="section-number-5">1.1.2.1</span> Simple IORef example in Haskell REPL:</h5>
<div class="outline-text-5" id="text-1-1-2-1">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">{- </span><span class="org-comment">===== Check The Types ====== -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.IORef</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">IORef</span>
<span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">IORef</span> a
  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">GHC.IORef.IORef</span> (<span class="org-haskell-constructor">GHC.STRef.STRef</span> <span class="org-haskell-constructor">GHC.Prim.RealWorld</span> a)
        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.IORef&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Eq</span> (<span class="org-haskell-type">IORef</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.IORef&#8217;</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t newIORef 
<span class="org-function-name">newIORef</span> <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> (<span class="org-haskell-type">IORef</span> a)
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t readIORef 
<span class="org-function-name">readIORef</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IORef</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t modifyIORef
<span class="org-function-name">modifyIORef</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IORef</span> a <span class="org-haskell-operator">-&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">=== Experiment 1 - IORef within the REPL ========== -}</span>

<span class="org-doc">{- | Extract IO a -&gt; a is only possible in the REPL due to it be inside an IO monad. -}</span>
<span class="org-haskell-operator">&gt;</span> cell <span class="org-haskell-operator">&lt;-</span> newIORef (100.0 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t cell
<span class="org-function-name">cell</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IORef</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readIORef</span> cell
100.0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t readIORef cell
<span class="org-haskell-definition">readIORef</span> cell <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Apply a function to value returned from reading the cell </span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------------------------------------------</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> ((<span class="org-haskell-operator">+</span>)100) <span class="org-haskell-operator">$</span> readIORef cell
200.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">&lt;$&gt;</span> ((<span class="org-haskell-operator">+</span>)100) <span class="org-haskell-operator">&lt;$&gt;</span> readIORef cell
600.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">+</span>5) <span class="org-haskell-operator">&lt;$&gt;</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">&lt;$&gt;</span> ((<span class="org-haskell-operator">+</span>)100) <span class="org-haskell-operator">&lt;$&gt;</span> readIORef cell
605.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">+</span>5) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">.</span> ((<span class="org-haskell-operator">+</span>)100) <span class="org-haskell-operator">&lt;$&gt;</span> readIORef cell
605.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> ((<span class="org-haskell-operator">+</span>5) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">.</span> ((<span class="org-haskell-operator">+</span>)100)) <span class="org-haskell-operator">$</span> readIORef cell
605.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Update </span>
<span class="org-comment-delimiter">--</span><span class="org-comment">----------------------------------------------------------</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t writeIORef 
<span class="org-function-name">writeIORef</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IORef</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">writeIORef</span> cell 500.322
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readIORef</span> cell
500.322
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span>  fmap ((<span class="org-haskell-operator">+</span>5) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">.</span> ((<span class="org-haskell-operator">+</span>)100)) <span class="org-haskell-operator">$</span> readIORef cell
1805.966
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Modify </span>
<span class="org-comment-delimiter">--</span><span class="org-comment">--------------------------------------------------------</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">writeIORef</span> cell 200.0


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readIORef</span> cell
200.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t modifyIORef 
<span class="org-function-name">modifyIORef</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IORef</span> a <span class="org-haskell-operator">-&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span>  modifyIORef cell (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 3.0 <span class="org-haskell-operator">*</span> x )
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readIORef</span> cell
600.0

<span class="org-haskell-operator">&gt;</span>  modifyIORef cell (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 3.0 <span class="org-haskell-operator">*</span> x )
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readIORef</span> cell
1800.0

<span class="org-haskell-operator">&gt;</span>  modifyIORef cell (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 3.0 <span class="org-haskell-operator">*</span> x )
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">readIORef</span> cell
5400.0
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: Counter.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.IORef</span> 

<span class="org-haskell-constructor">:</span>{    
<span class="org-function-name">counter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> (<span class="org-haskell-type">IORef</span> <span class="org-haskell-type">Int</span>)
<span class="org-haskell-definition">counter</span> <span class="org-haskell-operator">=</span> newIORef 0
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{ 
<span class="org-function-name">incrCounter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IORef</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">incrCounter</span> cell <span class="org-haskell-operator">=</span> modifyIORef cell (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> 1) 
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">showCounter</span> cell <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  value <span class="org-haskell-operator">&lt;-</span> readIORef cell
  putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"The counter value is "</span> <span class="org-haskell-operator">++</span> show value
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t showCounter 
<span class="org-function-name">showCounter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">IORef</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> counter <span class="org-haskell-definition">&gt;&gt;=</span> showCounter 
<span class="org-haskell-constructor">The</span> counter value is 0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">testCounter1</span> c <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>  
  incrCounter c
  incrCounter c
  incrCounter c
  showCounter c
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t testCounter1 
<span class="org-function-name">testCounter1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IORef</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>  
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">testCounter1</span> <span class="org-haskell-definition">=&lt;&lt;</span> counter 
<span class="org-haskell-constructor">The</span> counter value is 3
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">showCounter</span> <span class="org-haskell-definition">=&lt;&lt;</span> counter
<span class="org-haskell-constructor">The</span> counter value is 0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> counter <span class="org-haskell-definition">&gt;&gt;=</span> showCounter 
<span class="org-haskell-constructor">The</span> counter value is 0
<span class="org-haskell-operator">&gt;</span> 



<span class="org-haskell-operator">&gt;</span> c <span class="org-haskell-operator">&lt;-</span> counter 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t c
<span class="org-function-name">c</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IORef</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">showCounter</span> c
<span class="org-haskell-constructor">The</span> counter value is 0

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrCounter</span> c
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">showCounter</span> c
<span class="org-haskell-constructor">The</span> counter value is 1
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrCounter</span> c <span class="org-haskell-operator">&gt;&gt;</span> showCounter c
<span class="org-haskell-constructor">The</span> counter value is 2
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrCounter</span> c <span class="org-haskell-operator">&gt;&gt;</span> showCounter c
<span class="org-haskell-constructor">The</span> counter value is 3
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrCounter</span> c <span class="org-haskell-operator">&gt;&gt;</span> showCounter c
<span class="org-haskell-constructor">The</span> counter value is 4
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrCounter</span> c <span class="org-haskell-operator">&gt;&gt;</span> showCounter c
<span class="org-haskell-constructor">The</span> counter value is 5
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrCounter</span> c <span class="org-haskell-operator">&gt;&gt;</span> showCounter c
<span class="org-haskell-constructor">The</span> counter value is 6
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrCounter</span> c <span class="org-haskell-operator">&gt;&gt;</span> showCounter c
<span class="org-haskell-constructor">The</span> counter value is 7
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrCounter</span> c <span class="org-haskell-operator">&gt;&gt;</span> showCounter c
<span class="org-haskell-constructor">The</span> counter value is 8
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
