haskell/Mutable_References.org
**** Infinite loop with delay 

#+BEGIN_SRC haskell 
  import Data.IORef
  import Control.Concurrent (threadDelay)
  import Control.Monad (forever)    

  delay1Second = 1000000 -- 1 million us = 1 second 
      
  :{
  runLoop = do     
    count <- newIORef 0
    forever $ do val <- readIORef count
                 putStrLn $ "Counter is " ++ show val
                 modifyIORef count (+1)
                 threadDelay delay1Second
  :}

   
  >  runLoop 
  Counter is 0
  Counter is 1
  Counter is 2
  Counter is 3
  Counter is 4
  Counter is 5
  Counter is 6
  Counter is 7
  Counter is 8
  Counter is 9
  Counter is 10
  Counter is 11
  Counter is 12
  Counter is 13
  Counter is 14
  Counter is 15
  Counter is 16
  Counter is 17
  ... ... ...
      
#+END_SRC
**** Simulating objects with closures 

The code below simulates an object counter that has an internal
integer state. The functions or IO actions incrementCounter,
decrementcounter and getCounter simulate the object's methods.

#+BEGIN_SRC haskell 
import qualified Data.IORef as IORef

:{
data Counter = Counter { incrementCounter :: IO () 
                       , decrementCounter :: IO () 
                       , getCounter       :: IO Int                      
                       }
:}
    
:{
newCounter :: IO Counter    
newCounter = do 
    counter <- IORef.newIORef 0        
    return $ Counter { incrementCounter = IORef.modifyIORef counter (+1)               
                     , decrementCounter = IORef.modifyIORef counter (+(-1))
                     , getCounter       = IORef.readIORef counter
                     }
:}

#+END_SRC

Running: 

#+BEGIN_SRC haskell 
> counter <- newCounter 
counter :: Counter

> getCounter counter
0
it :: Int
> 
> incrementCounter counter
it :: ()
> getCounter counter
1
it :: Int
> incrementCounter counter
it :: ()
> getCounter counter
2
it :: Int
> incrementCounter counter >> getCounter counter
3
it :: Int
> incrementCounter counter >> getCounter counter
4
it :: Int
> 
> decrementCounter counter >> getCounter counter
3
it :: Int
> decrementCounter counter >> getCounter counter
2
it :: Int
> decrementCounter counter >> getCounter counter
1
it :: Int
> decrementCounter counter >> getCounter counter
0
it :: Int
> 

#+END_SRC
** ST Monad - Mutable References Inside Pure Functions 
