haskell/Mutable_References.html

<div id="outline-container-sec-1-1-2-4" class="outline-5">
<h5 id="sec-1-1-2-4"><span class="section-number-5">1.1.2.4</span> Infinite loop with delay</h5>
<div class="outline-text-5" id="text-1-1-2-4">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.IORef</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Concurrent</span> (threadDelay)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span> (forever)    

<span class="org-haskell-definition">delay1Second</span> <span class="org-haskell-operator">=</span> 1000000 <span class="org-comment-delimiter">-- </span><span class="org-comment">1 million us = 1 second </span>

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">runLoop</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>     
  count <span class="org-haskell-operator">&lt;-</span> newIORef 0
  forever <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span> val <span class="org-haskell-operator">&lt;-</span> readIORef count
               putStrLn <span class="org-haskell-operator">$</span> <span class="org-string">"Counter is "</span> <span class="org-haskell-operator">++</span> show val
               modifyIORef count (<span class="org-haskell-operator">+</span>1)
               threadDelay delay1Second
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span>  runLoop 
<span class="org-haskell-constructor">Counter</span> is 0
<span class="org-haskell-constructor">Counter</span> is 1
<span class="org-haskell-constructor">Counter</span> is 2
<span class="org-haskell-constructor">Counter</span> is 3
<span class="org-haskell-constructor">Counter</span> is 4
<span class="org-haskell-constructor">Counter</span> is 5
<span class="org-haskell-constructor">Counter</span> is 6
<span class="org-haskell-constructor">Counter</span> is 7
<span class="org-haskell-constructor">Counter</span> is 8
<span class="org-haskell-constructor">Counter</span> is 9
<span class="org-haskell-constructor">Counter</span> is 10
<span class="org-haskell-constructor">Counter</span> is 11
<span class="org-haskell-constructor">Counter</span> is 12
<span class="org-haskell-constructor">Counter</span> is 13
<span class="org-haskell-constructor">Counter</span> is 14
<span class="org-haskell-constructor">Counter</span> is 15
<span class="org-haskell-constructor">Counter</span> is 16
<span class="org-haskell-constructor">Counter</span> is 17
<span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-2-5" class="outline-5">
<h5 id="sec-1-1-2-5"><span class="section-number-5">1.1.2.5</span> Simulating objects with closures</h5>
<div class="outline-text-5" id="text-1-1-2-5">
<p>
The code below simulates an object counter that has an internal
integer state. The functions or IO actions incrementCounter,
decrementcounter and getCounter simulate the object's methods.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Data.IORef</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">IORef</span>

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Counter</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Counter</span> { incrementCounter <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> 
                       , decrementCounter <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span> 
                       , getCounter       <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Int</span>                      
                       }
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">newCounter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Counter</span>    
<span class="org-haskell-definition">newCounter</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> 
    counter <span class="org-haskell-operator">&lt;-</span> IORef.newIORef 0        
    return <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Counter</span> { incrementCounter <span class="org-haskell-operator">=</span> IORef.modifyIORef counter (<span class="org-haskell-operator">+</span>1)               
                     , decrementCounter <span class="org-haskell-operator">=</span> IORef.modifyIORef counter (<span class="org-haskell-operator">+</span>(<span class="org-haskell-operator">-</span>1))
                     , getCounter       <span class="org-haskell-operator">=</span> IORef.readIORef counter
                     }
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
Running: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> counter <span class="org-haskell-operator">&lt;-</span> newCounter 
<span class="org-function-name">counter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Counter</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">getCounter</span> counter
0
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrementCounter</span> counter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">getCounter</span> counter
1
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrementCounter</span> counter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">getCounter</span> counter
2
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrementCounter</span> counter <span class="org-haskell-operator">&gt;&gt;</span> getCounter counter
3
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">incrementCounter</span> counter <span class="org-haskell-operator">&gt;&gt;</span> getCounter counter
4
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">decrementCounter</span> counter <span class="org-haskell-operator">&gt;&gt;</span> getCounter counter
3
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">decrementCounter</span> counter <span class="org-haskell-operator">&gt;&gt;</span> getCounter counter
2
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">decrementCounter</span> counter <span class="org-haskell-operator">&gt;&gt;</span> getCounter counter
1
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">decrementCounter</span> counter <span class="org-haskell-operator">&gt;&gt;</span> getCounter counter
0
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> ST Monad - Mutable References Inside Pure Functions</h3>
