haskell/Mutable_References.html
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
The ST monad is used to perform local mutability. The mutability
happens only inside the function. 
</p>

<p>
Modules: 
</p>

<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/base-4.9.1.0/docs/Data-STRef.html">Data.STRef</a>
</li>

<li><a href="https://hackage.haskell.org/package/base-4.8.2.0/docs/Control-Monad-ST.html">Control.Monad.ST</a>
</li>

<li><a href="https://hackage.haskell.org/package/base-4.9.1.0/docs/Data-STRef-Lazy.html">Data.STRef.Lazy</a>
</li>
</ul>

<p>
Functions: 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Module</b> Data.STRef</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">newSTRef</td>
<td class="left">::</td>
<td class="left">a -&gt; ST s (STRef s a)</td>
<td class="left">Create a new STRef in the current state thread</td>
</tr>

<tr>
<td class="left">readSTRef</td>
<td class="left">::</td>
<td class="left">STRef s a -&gt; ST s a</td>
<td class="left">Read the value of an STRef</td>
</tr>

<tr>
<td class="left">writeSTRef</td>
<td class="left">::</td>
<td class="left">STRef s a -&gt; a -&gt; ST s ()</td>
<td class="left">Write a new value into an STRef</td>
</tr>

<tr>
<td class="left">modifySTRef</td>
<td class="left">::</td>
<td class="left">STRef s a -&gt; (a -&gt; a) -&gt; ST s ()</td>
<td class="left">Mutate the contents of an STRef.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>Module</b> Control.Monad.ST</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">runST</td>
<td class="left">::</td>
<td class="left">(forall s. ST s a) -&gt; a</td>
<td class="left">Extract content</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Monad and Functor signatures</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">(&gt;&gt;=)</td>
<td class="left">::</td>
<td class="left">ST s a -&gt; (a -&gt; ST s b) -&gt; ST s b</td>
<td class="left">Monad bind operator</td>
</tr>

<tr>
<td class="left">return</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Monad return function</td>
</tr>

<tr>
<td class="left">(&gt;&gt;)</td>
<td class="left">::</td>
<td class="left">ST s a -&gt; ST s b -&gt; ST s b</td>
<td class="left">Monad (&gt;&gt;) operator</td>
</tr>

<tr>
<td class="left">fmap</td>
<td class="left">::</td>
<td class="left">(a -&gt; b) -&gt; ST s a -&gt; ST s b</td>
<td class="left">Functor operator</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Examples</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Example 1: Sum all list elements.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad.ST</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.STRef</span>    
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span> (forM_)

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">sumST</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-definition">sumST</span> xs <span class="org-haskell-operator">=</span> runST <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>           <span class="org-comment-delimiter">-- </span><span class="org-comment">Extract value from ST Monad </span>

    n <span class="org-haskell-operator">&lt;-</span> newSTRef 0             <span class="org-comment-delimiter">-- </span><span class="org-comment">Create an STRef mutable reference (aka variable)</span>

    forM_ xs <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span>         <span class="org-comment-delimiter">-- </span><span class="org-comment">For each element of xs, add it to n </span>
        modifySTRef n (<span class="org-haskell-operator">+</span>x)      

    readSTRef n                 <span class="org-comment-delimiter">-- </span><span class="org-comment">read value from mutable reference n and return it</span>
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sumST</span> [1, 2, 3, 4, 5, 6]
21
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sum</span> [1, 2, 3, 4, 5, 6]
21

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sumST</span> [1<span class="org-haskell-operator">..</span>100]
5050
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sumST</span> [1<span class="org-haskell-operator">..</span>1000000]
500000500000
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>



<p>
Example: Alternative fold implementation in a imperative-like way.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">foldST</span> <span class="org-haskell-operator">::</span> (acc <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">-&gt;</span> acc) <span class="org-haskell-operator">-&gt;</span> acc <span class="org-haskell-operator">-&gt;</span> [x] <span class="org-haskell-operator">-&gt;</span> acc 
<span class="org-haskell-definition">foldST</span> step acc0 xs <span class="org-haskell-operator">=</span>
    runST <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span> accum <span class="org-haskell-operator">&lt;-</span> newSTRef acc0
               forM_ xs <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> modifySTRef accum (<span class="org-haskell-operator">\</span>a <span class="org-haskell-operator">-&gt;</span> step a x)
               readSTRef accum
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldl</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10<span class="org-haskell-operator">*</span>acc <span class="org-haskell-operator">+</span> x) 0 [1, 2, 3, 4, 5]
12345
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldl</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10<span class="org-haskell-operator">*</span>acc <span class="org-haskell-operator">+</span> x) 0 [1, 2, 3, 4, 5, 6]
123456
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldST</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10<span class="org-haskell-operator">*</span>acc <span class="org-haskell-operator">+</span> x) 0 [1, 2, 3, 4, 5]
12345
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldST</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10<span class="org-haskell-operator">*</span>acc <span class="org-haskell-operator">+</span> x) 0 [1, 2, 3, 4, 5, 6]
123456
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
It is equivalent to the code below in Python. This function is a pure
fucntion like foldST despite it has local mutability.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">foldl</span>(step, acc0, xs):
    <span class="org-variable-name">accum</span> = acc0 
    <span class="org-keyword">for</span> x <span class="org-keyword">in</span> xs:
        <span class="org-variable-name">accum</span> = step(accum, x)
    <span class="org-keyword">return</span> accum


&gt;&gt;&gt; <span class="org-keyword">def</span> <span class="org-function-name">foldl</span>(step, acc0, xs):
...     <span class="org-variable-name">accum</span> = acc0 
...     <span class="org-keyword">for</span> x <span class="org-keyword">in</span> xs:
...         <span class="org-variable-name">accum</span> = step(accum, x)
...     <span class="org-keyword">return</span> accum
... 
&gt;&gt;&gt; 

&gt;&gt;&gt; foldl(<span class="org-keyword">lambda</span> a, x: 10 * a + x, 0, [1, 2, 3, 4, 5])
12345
&gt;&gt;&gt;
&gt;&gt;&gt; foldl(<span class="org-keyword">lambda</span> a, x: 10 * a + x, 0, [1, 2, 3, 4, 5, 6])
123456
&gt;&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nobody</p>
<p class="date">Created: 2018-06-17 Sun 02:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
